IDENTIFICATION DIVISION.
PROGRAM-ID. HELLOWORLD.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. RM-COBOL.
OBJECT-COMPUTER. RM-COBOL.

DATA DIVISION.
FILE SECTION.

PROCEDURE DIVISION.

MAIN-LOGIC SECTION.
  DISPLAY "Hello world!"
STOP RUN.
